AccountingRegisters/Учетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccountingRegister>
		<Properties>
			<Name>Учетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Учетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Предприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПлана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКРХ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Крахмал</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиДок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Catalogs/Предприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Предприятия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрефиксПредприятия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПредприятия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Учет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АльтНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияУчет</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорпоративныйEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьВОтчетахГД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедетсяВалютныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролировать10</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролировать41</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролировать43</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзитныйСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзитноеПодразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьТранзитныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаАрендодателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйОбъемХранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьОФК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет79</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьДебиторскуюЗадолженность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтопроведениеПереводов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаМСФО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственноеПредприятие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗакрытияЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗакрытияЗатрат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьЗаявкиНаоплатуБезСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяПолитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеПолитики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОрганизацииДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопСписокРеспондентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Признак</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EMail</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокДокументовПодразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетПоПодразделениям</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ChartsOfAccounts/Учетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<ChartOfAccounts>
		<Properties>
			<Name>Учетный</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтражаетсяВБалансе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБыстрогоВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДенежныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Крахмал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

AccountingRegisters/Учетный/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧДокумента.Предприятия КАК Предприятие,
	|	ТЧДокумента.СчетДт КАК СчетДт,
	|	ТЧДокумента.СчетКт КАК СчетКт
	|ПОМЕСТИТЬ ВТ_ТЧДокумента
	|ИЗ
	|	&ТЧДокумента КАК ТЧДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧДокумента.Предприятие КАК Предприятие,
	|	ВТ_ТЧДокумента.СчетДт КАК СчетДт,
	|	ВТ_ТЧДокумента.СчетКт КАК СчетКт,
	|	ВЫРАЗИТЬ(ВТ_ТЧДокумента.Предприятие КАК Справочник.Предприятия).УчетПоПодразделениям КАК ПредприятиеУчетПоПодразделениям,
	|	ВЫРАЗИТЬ(ВТ_ТЧДокумента.СчетДт КАК ПланСчетов.Учетный).УчетПоПодразделениям КАК СчетДтУчетПоПодразделениям,
	|	ВЫРАЗИТЬ(ВТ_ТЧДокумента.СчетКт КАК ПланСчетов.Учетный).УчетПоПодразделениям КАК СчетКтУчетПоПодразделениям,
	|	ЛОЖЬ КАК СчетКтУчетоПоЦФО,
	|	ЛОЖЬ КАК СчетДтУчетоПоЦФО,
	|	ВЫРАЗИТЬ(ВТ_ТЧДокумента.СчетКт КАК ПланСчетов.Учетный).ЗапретитьИспользоватьВПроводках КАК СчетКтЗапретитьИспользоватьВПроводках,
	|	ВЫРАЗИТЬ(ВТ_ТЧДокумента.СчетДт КАК ПланСчетов.Учетный).ЗапретитьИспользоватьВПроводках КАК СчетДтЗапретитьИспользоватьВПроводках,
	|	ВЫРАЗИТЬ(ВТ_ТЧДокумента.Предприятие КАК Справочник.Предприятия).ВидДеятельности КАК Подразделение
	|ИЗ
	|	ВТ_ТЧДокумента КАК ВТ_ТЧДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТЧДокумента.СчетДт,
	|	ВТ_ТЧДокумента.Предприятие,
	|	ВТ_ТЧДокумента.СчетКт";
		
	
	Запрос.УстановитьПараметр("ТЧДокумента", ЭтотОбъект.Выгрузить());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СоотвПредприятийПодр = Новый Соответствие;
	СоотвПредприятийПодрОсн = Новый Соответствие;
	СоотвСчетДтПодр = Новый Соответствие;
	СоотвСчетКтПодр = Новый Соответствие;
	СоотвСчетДтЦФО = Новый Соответствие;
	СоотвСчетКтЦФО = Новый Соответствие;
	СоотвСчетДтЗапретитьИспользоватьВПроводках = Новый Соответствие;
	СоотвСчетКтЗапретитьИспользоватьВПроводках = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		
		Если СоотвПредприятийПодр.Получить(Выборка.Предприятие) = Неопределено Тогда
			СоотвПредприятийПодр.Вставить(Выборка.Предприятие, Выборка.ПредприятиеУчетПоПодразделениям);		
		КонецЕсли;
		
		Если СоотвПредприятийПодрОсн.Получить(Выборка.Предприятие) = Неопределено Тогда
			СоотвПредприятийПодрОсн.Вставить(Выборка.Предприятие, Выборка.Подразделение);		
		КонецЕсли;
		
		Если СоотвСчетДтПодр.Получить(Выборка.СчетДт) = Неопределено Тогда
			СоотвСчетДтПодр.Вставить(Выборка.СчетДт, Выборка.СчетДтУчетПоПодразделениям);		
		КонецЕсли;
		
		Если СоотвСчетКтПодр.Получить(Выборка.СчетКт) = Неопределено Тогда
			СоотвСчетКтПодр.Вставить(Выборка.СчетКт, Выборка.СчетКтУчетПоПодразделениям);		
		КонецЕсли;

		Если СоотвСчетДтЦФО.Получить(Выборка.СчетДт) = Неопределено Тогда
			СоотвСчетДтЦФО.Вставить(Выборка.СчетДт, Выборка.СчетДтУчетоПоЦФО);		
		КонецЕсли;
		
		Если СоотвСчетКтЦФО.Получить(Выборка.СчетКт) = Неопределено Тогда
			СоотвСчетКтЦФО.Вставить(Выборка.СчетКт, Выборка.СчетКтУчетоПоЦФО);		
		КонецЕсли;
		
		Если СоотвСчетДтЗапретитьИспользоватьВПроводках.Получить(Выборка.СчетДт) = Неопределено Тогда
			СоотвСчетДтЗапретитьИспользоватьВПроводках.Вставить(Выборка.СчетДт, Выборка.СчетДтЗапретитьИспользоватьВПроводках);		
		КонецЕсли;
		
		Если СоотвСчетКтЗапретитьИспользоватьВПроводках.Получить(Выборка.СчетКт) = Неопределено Тогда
			СоотвСчетКтЗапретитьИспользоватьВПроводках.Вставить(Выборка.СчетКт, Выборка.СчетКтЗапретитьИспользоватьВПроводках);		
		КонецЕсли;

	КонецЦикла;
	
	СЦФакт = Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина);
	
	ЭтоАдминистратор = БюджетныйНаСервере.РольАдминаДоступнаСервер();
	
	//Нельзя удалять записи закрытого периода. Для Контроля 79-го счета  ,узнаем, эт опервое проведение документа , или нет
	РегистраторДвижений = ЭтотОбъект.Отбор.Регистратор.Значение;
	ВыборкаДвижений = РегистрыБухгалтерии.Учетный.ВыбратьПоРегистратору(РегистраторДвижений);		
	ПервоеПроведение = Истина;
	
	ЕстьПредприятие = НЕ РегистраторДвижений.Метаданные().Реквизиты.Найти("Предприятие") = Неопределено;
	//НеПроверятьДатуЗапрета = ЭтотОбъект.ДополнительныеСвойства.Свойство("НеПроверятьДатуЗапрета") И ЭтотОбъект.ДополнительныеСвойства.НеПроверятьДатуЗапрета = Истина;
	
	НеПроверятьДатуЗапрета = Истина;
	
	Если Не НеПроверятьДатуЗапрета Тогда
		
		Пока ВыборкаДвижений.Следующий() Цикл
			
			ПервоеПроведение = Ложь;
			
			ГлобальнаяДата = сабОбщегоНазначения.ПолучитьДатуЗапрета(ВыборкаДвижений);    //УЧ_Сервер.ДатаГлобальногоЗапрета();
			ДатаЗакрытияУчетПредприятие = УЧ_Сервер.ДатаЛокальногоЗапрета(ВыборкаДвижений.Предприятия);
			
			Если БюджетныйНаСервере.РольАдминаДоступнаСервер() ИЛИ БюджетныйНаСервере.РольФинансистаДоступна() Тогда
				ДатаЗакрытияУчет = ГлобальнаяДата;				
			Иначе
				ДатаЗакрытияУчет = Макс(ГлобальнаяДата,ДатаЗакрытияУчетПредприятие);
			КонецЕсли;
			
			Если ВыборкаДвижений.Период <= КонецДня(ДатаЗакрытияУчет) Тогда
				сабОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(
				ВыборкаДвижений,
				"Невозможно удаление записей учетного регистра ранее даты закрытия (" + Формат(ДатаЗакрытияУчет, "ДФ=dd.MM.yy") + ") по предприятию " + Строка(ВыборкаДвижений.Предприятия) + ".",
				,
				,
				"Дата",
				Отказ);
			КонецЕсли;
			
			Если ЕстьПредприятие Тогда
				Прервать;			
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//Обход записей набора записей
	МассивБезСумм = Новый Массив;
	Индекс = 1;
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		//подразделение основное заполняем
		Если Не СоотвПредприятийПодр.Получить(Запись.Предприятия) Тогда
			
			Если ЗначениеЗаполнено(Запись.СчетДт) И СоотвСчетДтПодр.Получить(Запись.СчетДт) Тогда
				Запись.ПодразделениеДт = СоотвПредприятийПодрОсн.Получить(Запись.Предприятия);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Запись.СчетКт) И СоотвСчетКтПодр.Получить(Запись.СчетКт) Тогда
				Запись.ПодразделениеКт = СоотвПредприятийПодрОсн.Получить(Запись.Предприятия);
			КонецЕсли;
			
		КонецЕсли;
		
		//Проверяем сценарий плана
		Если Не ЗначениеЗаполнено(Запись.СценарийПлана) Тогда 
			Запись.СценарийПлана = СЦФакт;
		КонецЕсли;
		
		//проверяем дальше		
		Если ЗначениеЗаполнено(Запись.СчетДт) И СоотвСчетДтЗапретитьИспользоватьВПроводках.Получить(Запись.СчетДт) Тогда
			Сообщить("Счет "+ Запись.СчетДт + " запрещено использовать в проводках. Для правильного формирования проводки попробуйте использовать субсчет. ");
			Отказ = Истина;
			Возврат		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Запись.СчетКт) И СоотвСчетКтЗапретитьИспользоватьВПроводках.Получить(Запись.СчетКт) Тогда
			Сообщить("Счет "+ Запись.СчетКт + " запрещено использовать в проводках. Для правильного формирования проводки попробуйте использовать субсчет. ");
			Отказ = Истина;
			Возврат		
		КонецЕсли;
		
		//Проверка на доступность предприятия пользователю
		Если (ПараметрыСеанса.ДоступныеПредприятия.Найти(Запись.Предприятия) = Неопределено) ИЛИ НЕ ПараметрыСеанса.ДоступныеПредприятияПросмотр.Найти(Запись.Предприятия) = Неопределено Тогда
			
			Если НЕ БюджетныйНаСервере.РольФинансистаДоступна() И НЕ РольДоступна("ОФК") Тогда  //исключение для тех, кто классифицирует Движения
				Сообщить("При проведении документа обнаружено недоступное для данного пользователя предприятие " + Запись.Предприятия + ". Проведение по регистру ""Учетный"" отменено");
				Отказ = истина;			
			КонецЕсли;
			
		КонецЕсли;
		
		//Незаполненные значение произвольного субконто принудительно обращаем в Неопределено
		//Если Запись.СубконтоДт.Произвольное <> Неопределено И Не ЗначениеЗаполнено(Запись.СубконтоДт.Произвольное) Тогда
		//	Запись.СубконтоДт.Произвольное = Неопределено;
		//КонецЕсли;
		
		//Если Запись.СубконтоКт.Произвольное <> Неопределено И Не ЗначениеЗаполнено(Запись.СубконтоКт.Произвольное) Тогда
		//	Запись.СубконтоКт.Произвольное = Неопределено;
		//КонецЕсли;
		
		Для Каждого ТекСубконтоДт Из Запись.СубконтоДт Цикл
			
			Если ЗначениеЗаполнено(ТекСубконтоДт.Значение) Или ТипЗнч(ТекСубконтоДт.Значение) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекСубконтоДт.Ключ.ТипЗначения.Типы().Количество() > 1 Тогда
				Запись.СубконтоДт[ТекСубконтоДт.Ключ] = Неопределено;
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого ТекСубконтоКт Из Запись.СубконтоКт Цикл
			
			Если ЗначениеЗаполнено(ТекСубконтоКт.Значение) Или ТипЗнч(ТекСубконтоКт.Значение) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекСубконтоКт.Ключ.ТипЗначения.Типы().Количество() > 1 Тогда
				Запись.СубконтоКт[ТекСубконтоКт.Ключ] = Неопределено;
			КонецЕсли;
			
		КонецЦикла; 	
		
		//проверка даты запрета редактирования по предприятию
		Если Не НеПроверятьДатуЗапрета Тогда
			
			Если Индекс = 1 ИЛИ НЕ ЕстьПредприятие Тогда //проверяем только первую запись
				
				ГлобальнаяДата = сабОбщегоНазначения.ПолучитьДатуЗапрета(Запись);    //УЧ_Сервер.ДатаГлобальногоЗапрета();
				ДатаЗакрытияУчетПредприятие = УЧ_Сервер.ДатаЛокальногоЗапрета(Запись.Предприятия);
				
				Если ЭтоАдминистратор Тогда
					ДатаЗакрытияУчет = ГлобальнаяДата;				
				Иначе
					ДатаЗакрытияУчет = Макс(ГлобальнаяДата,ДатаЗакрытияУчетПредприятие);
				КонецЕсли;
				
				Если Запись.Период <= КонецДня(ДатаЗакрытияУчет)  Тогда
					сабОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(
					Запись,
					"Невозможно формирование записей учетного регистра ранее даты закрытия (" + Формат(ДатаЗакрытияУчет, "ДФ=dd.MM.yy") + ") по предприятию " + Строка(Запись.Предприятия) + ".",
					,
					,
					"Дата",
					Отказ);	
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//пустые движения
		КоличествоДт = ?(Запись.КоличествоДт = Null, 0, Запись.КоличествоДт);
		КоличествоКт = ?(Запись.КоличествоКт = Null, 0, Запись.КоличествоКт);
		
		Если НЕ Запись.Сумма И НЕ КоличествоДт И НЕ КоличествоКт Тогда
			МассивБезСумм.Добавить(Запись);
		КонецЕсли;
		
		Индекс = Индекс + 1;	
	КонецЦикла;
	
	Для каждого ТекЗапись Из МассивБезСумм Цикл
		ЭтотОбъект.Удалить(ТекЗапись);		
	КонецЦикла; 
	
КонецПроцедуры
